# DataFrames

In [3]:
import numpy as np
import pandas as pd

In [4]:
fila = ['ventas1','ventas2','ventas3']
columnas= ['zonaA','zonaB','zonaC']
datos= [[123,421,256],[234,541,257],[120,451,258]]
#Se crea una matriz de 3x3

In [5]:
dataframe= pd.DataFrame(datos,fila,columnas)
#En este orden se construye el DataFrame
print(dataframe)

         zonaA  zonaB  zonaC
ventas1    123    421    256
ventas2    234    541    257
ventas3    120    451    258

In [6]:
dataframe.loc[['ventas1','ventas2']] #seleeciona las filas seleccionadas

         zonaA  zonaB  zonaC
ventas1    123    421    256
ventas2    234    541    257

In [7]:
dataframe['zonaA'] #Seleccionas columnas

ventas1    123
ventas2    234
ventas3    120
Name: zonaA, dtype: int64

In [8]:
dataframe[['zonaA','zonaB']] #Seleccionar varias columnas

         zonaA  zonaB
ventas1    123    421
ventas2    234    541
ventas3    120    451

In [9]:
dataframe.loc['ventas1']['zonaA']#Seleccionar un valor en especifico

123

In [10]:
#Agregar columnas
dataframe['Todas las zonas']= dataframe['zonaA']+dataframe['zonaB']+dataframe['zonaC']

In [11]:
dataframe

         zonaA  zonaB  zonaC  Todas las zonas
ventas1    123    421    256              800
ventas2    234    541    257             1032
ventas3    120    451    258              829

In [12]:
#Borrar en la visualizacion Columnas
dataframe.drop('Todas las zonas',axis=1)

         zonaA  zonaB  zonaC
ventas1    123    421    256
ventas2    234    541    257
ventas3    120    451    258

In [13]:
#Borrar definitivamente Columnas
dataframe.drop('Todas las zonas',axis=1, inplace=True)

In [14]:
dataframe

         zonaA  zonaB  zonaC
ventas1    123    421    256
ventas2    234    541    257
ventas3    120    451    258

In [15]:
#Borrar fila en la visualizacion
dataframe.drop('ventas3')

         zonaA  zonaB  zonaC
ventas1    123    421    256
ventas2    234    541    257

In [16]:
#Borrar fila permanentemente
dataframe.drop('ventas3',axis=0,inplace=True)

In [17]:
dataframe

         zonaA  zonaB  zonaC
ventas1    123    421    256
ventas2    234    541    257

In [18]:
#Ver tamaño que tiene el DataFrame
dataframe.shape

(2, 3)

In [19]:
dataframe

         zonaA  zonaB  zonaC
ventas1    123    421    256
ventas2    234    541    257

## Condicionales

In [21]:
condicion =dataframe > 200
dataframe[condicion]

         zonaA  zonaB  zonaC
ventas1    NaN    421    256
ventas2  234.0    541    257

In [23]:
condicion = dataframe ['zonaA'] >200
dataframe[condicion]

         zonaA  zonaB  zonaC
ventas2    234    541    257

In [27]:
condicion = (dataframe ['zonaA'] >200) & (dataframe ['zonaB'] >250)
dataframe[condicion]

         zonaA  zonaB  zonaC
ventas2    234    541    257

## Modificación de filas

In [31]:
filas1 = 'ventas1 ventas2 ventas3'.split()
columnas1 = 'ZonaA ZonaB ZonaC'.split()
datos1= [[100,200,150], [300,234,400], [600,100,200]]
dataframe1= pd.DataFrame(datos1,filas1,columnas1)

In [32]:
dataframe1

         ZonaA  ZonaB  ZonaC
ventas1    100    200    150
ventas2    300    234    400
ventas3    600    100    200

In [33]:
nuevas_filas = 'dia1 dia2 dia3'.split()

In [34]:
dataframe1['dias']= nuevas_filas
dataframe1

         ZonaA  ZonaB  ZonaC  dias
ventas1    100    200    150  dia1
ventas2    300    234    400  dia2
ventas3    600    100    200  dia3

In [35]:
#Modificacion en la vista
dataframe1.set_index('dias')

      ZonaA  ZonaB  ZonaC
dias
dia1    100    200    150
dia2    300    234    400
dia3    600    100    200

In [36]:
#Modificacion permanente
dataframe1= dataframe1.set_index('dias')

In [37]:
dataframe1

      ZonaA  ZonaB  ZonaC
dias
dia1    100    200    150
dia2    300    234    400
dia3    600    100    200